Autodesk.Revit.DB.Structure.LineLoad.ProjectedLoad
Returns whether the load is projected or not.

Autodesk.Revit.DB.Structure.LineLoad.Moment(System.Int32)
Returns the three dimensional moment applied to one of the points for the line load.
index: The index of the point to return.
Remarks: An index of 0 represents the start point and 1 represents the end point. The moment is
measured in Feet*Kg / Sec.

Autodesk.Revit.DB.Structure.LineLoad.Moment2
Returns the three dimensional moment applied to the end point of the line load.
Remarks: The moment is measured in Feet*Kg / Sec.

Autodesk.Revit.DB.Structure.LineLoad.Moment1
Returns the three dimensional moment applied to the start point of the line load.
Remarks: The moment is measured in Feet*Kg / Sec.

Autodesk.Revit.DB.Structure.LineLoad.Force(System.Int32)
Returns the three dimensional force applied to one of the points for the line load.
index: The index of the point to return.
Remarks: An index of 0 represents the start point and 1 represents the end point. The force is measured in Kg / Sec.

Autodesk.Revit.DB.Structure.LineLoad.Force2
Returns the three dimensional force applied to the end point of the line load.
Remarks: The force is measured in Kg / Sec.

Autodesk.Revit.DB.Structure.LineLoad.Force1
Returns the three dimensional force applied to the start point of the line load.
Remarks: The force is measured in Kg / Sec.

Autodesk.Revit.DB.Structure.LineLoad.Point(System.Int32)
Returns the three dimensional location of one of the points for the line load.
index: The index of the point to return.
Remarks: An index of 0 represents the start point and 1 represents the end point. The location of
the point is measured in decimal feet.

Autodesk.Revit.DB.Structure.LineLoad.EndPoint
Returns the three dimensional location of the end point for the line load.
Remarks: The location of the end point is measured in decimal feet.

Autodesk.Revit.DB.Structure.LineLoad.StartPoint
Returns the three dimensional location of the start point for the line load.
Remarks: The location of the start point is measured in decimal feet.

Autodesk.Revit.DB.Structure.LineLoad.UniformLoad
Report if the load is uniform.
Remarks: This property will return True is the line load is uniform, i.e. the load is that same
across the entire line.

Autodesk.Revit.DB.Structure.LineLoad
An object that represents a force/moment applied in a linear manner.
Remarks: The load/moment may be uniform or it may vary between the two ends of the line.